notebook/blog-2007-12-14-2031.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Updates from dtospace</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:53 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content="Updates from dtospace"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Updates from dtospace</h1>

<p>On my nightstand is a 1929 <a href="http://en.wikipedia.org/wiki/Epistemology">epistemology</a> text called <i>Mind and the World Order</i>, by <a href="http://en.wikipedia.org/wiki/Clarence_Irving_Lewis">Clarence Irving Lewis</a>. (Actually I've been firmly
lodged in the 1900-1936 period for quite some time now&mdash;whereas for
music it's the 70's.) Oddly enough, I've owned a used copy for some
years now, but never got around to reading it until now.
</p>
<p>
I know I often write about philosophy books on this blog, as it's a
big hobby for me. But don't anybody get the idea that I'm breezing
through these books. <i>Mind and the World Order</i> is not light reading;
it dives more or less immediately into such issues as (for example)
whether the universe has some special character or structure that
makes it susceptible to interpretation and categorization by the mind,
or if, instead, our shared categories are merely "the combined result
of the similarity of human animals, and of their primal interests, and
the similarities of the experience with which they have to deal." So
I have to carefully read and re-read each paragraph, often several
times, to understand what is being said and follow the long chains of
argument that logicians like Lewis revel in. The only thing I can
compare it to is reading a computer program.
</p>
<p>
So what have I learned about the structure of the universe now that
I'm 45 pages into the book? Well, Lewis seems to be saying that the
<i>possibility</i> of knowledge does not <i>require</i> us to believe that the
fabric of reality itself is somehow uniquely in tune with the
interpretive apparatus of the mind. (Compare this with Wittgenstein's
<a href="http://en.wikipedia.org/wiki/Tractatus_Logico-Philosophicus">"The world divides into facts."</a>)
</p>
<p>
Lewis is from my own home state of <a href="http://en.wikipedia.org/wiki/Massachusetts">Massachusetts</a>, which may be why I
find him a bit easier to read than <a href="http://en.wikipedia.org/wiki/Wittgenstein">Wittgenstein</a>. I can read the latter
only in translation (not to mention his utterly flat and
succinct-as-a-machine-gun writing style.) 
</p>
<p>
In other news, <a href="http://emacs-ontology-project.googlecode.com">Eon</a> should be in beta by New Year's.
</p></div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:53 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
